#### 🏗️ Terraform Plan Results for dev2

#### 📋 Format Check: `failure`
#### ⚡ Initialization: `success`
#### ✅ Validation: `success`
#### 📊 Plan: `success`
#### 🔄 Has Changes: `true`

<details><summary>📄 Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.database.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 3
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "nurlan_yagublu_dev2"
      + db_subnet_group_name                  = "nurlan-yagublu-dev2-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = false
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.8"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "nurlan-yagublu-dev2-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "nurlan-yagublu-dev2-postgres-params"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-postgres"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "Database"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all                              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-postgres"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "Database"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + timezone                              = (known after apply)
      + username                              = "pgadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_parameter_group.main will be created
  + resource "aws_db_parameter_group" "main" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = "nurlan-yagublu-dev2-postgres-params"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags         = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-postgres-params"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DBParameterGroup"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-postgres-params"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DBParameterGroup"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "1000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_statement"
          + value        = "all"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "max_connections"
          + value        = "100"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pg_stat_statements"
        }
    }

  # module.database.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "nurlan-yagublu-dev2-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-db-subnet-group"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DBSubnetGroup"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all                = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-db-subnet-group"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DBSubnetGroup"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_secretsmanager_secret.db_credentials will be created
  + resource "aws_secretsmanager_secret" "db_credentials" {
      + arn                            = (known after apply)
      + description                    = "Database credentials for nurlan-yagublu dev2"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "nurlan-yagublu-dev2-db-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-db-credentials"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DatabaseCredentials"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all                       = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-db-credentials"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "DatabaseCredentials"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
    }

  # module.database.aws_secretsmanager_secret_version.db_credentials will be created
  + resource "aws_secretsmanager_secret_version" "db_credentials" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.database.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.ecs.aws_appautoscaling_policy.ecs_policy_cpu[0] will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "nurlan-yagublu-dev2-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/nurlan-yagublu-dev2-cluster/nurlan-yagublu-dev2-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_policy_memory[0] will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "nurlan-yagublu-dev2-memory-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/nurlan-yagublu-dev2-cluster/nurlan-yagublu-dev2-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 85

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target[0] will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/nurlan-yagublu-dev2-cluster/nurlan-yagublu-dev2-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-autoscaling-target"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "AutoScalingTarget"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-autoscaling-target"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "AutoScalingTarget"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.app will be created
  + resource "aws_cloudwatch_log_group" "app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/nurlan-yagublu-dev2"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-ecs-logs"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "CloudWatchLogGroup"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all          = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-logs"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "CloudWatchLogGroup"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
    }

  # module.ecs.aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "nurlan-yagublu-dev2-flask-api"
    }

  # module.ecs.aws_ecr_repository.app will be created
  + resource "aws_ecr_repository" "app" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "nurlan-yagublu-dev2-flask-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-ecr-repository"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECRRepository"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all             = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecr-repository"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECRRepository"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "nurlan-yagublu-dev2-cluster"
      + tags     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-ecs-cluster"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSCluster"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-cluster"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSCluster"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.main will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "nurlan-yagublu-dev2-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 70
        }
      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # module.ecs.aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "nurlan-yagublu-dev2-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-ecs-service"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSService"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all                           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-service"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSService"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 70
        }
      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "flask-api"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "nurlan-yagublu-dev2-flask-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-task-definition"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSTaskDefinition"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all                 = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-task-definition"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "ECSTaskDefinition"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_iam_role.ecs_execution_role will be created
  + resource "aws_iam_role" "ecs_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev2-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-ecs-execution-role"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-execution-role"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nurlan-yagublu-dev2-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "Name"        = "nurlan-yagublu-ecs-task-role"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev2"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nurlan-yagublu-ecs-task-role"
          + "Project"     = "nurlan-yagublu"
          + "Type"        = "IAMRole"
          + "owner"       = "nurlan.yagublu@nixs.com"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_logs_policy will be created
  + resource "aws_iam_role_policy" "ecs_logs_policy" {
      + id          = (known after apply)
      + name        = "nurlan-yagublu-dev2-ecs-logs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_secrets_policy will be created
  + resource "aws_iam_role_policy" "ecs_secrets_policy" {
      + id          = (known after apply)
      + name        = "nurlan-yagublu-dev2-ecs-secrets-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_task_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_policy" {
      + id          = (known after apply)
      + name        = "nurlan-yagublu-dev2-ecs-task-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "nurlan-yagublu-dev2-ecs-execution-role"
    }

  # module.ecs.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "nurlan-yagublu-dev2-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "CostCenter"  = "development"
          + 
```

</details>

*Pusher: @nurlanyagublu, Action: `pull_request`, Environment: `dev2`*